[{
	"title": "Greetings, Earthlings",
	"date": "May 7, 2020",
	"data": {
		"txt0": "Finally, I'm writing it. I feel there is a lot to say, but not wanna say everything in one. I made this site for everything, anything sometimes technical sometime not. Basically, I'm starting with myself. I have lots of interest in lots of things, I even don't know why, but anything related to science or tech, I can't hold myself away from it. This describes why I'm into computers. Long story short, I do software development. I love open source community lot (I will explain it later). Right now I'm doing Google Summer of Code with GNOME organization.",
		"txt1": "Finally Finished first little blog, phew. Next some blogs gonna be about GNOME journey."
	}
}, {
	"title": "Finally Landed on Planet GNOME",
	"date": "May 12, 2020",
	"data": {
		"txt0": "Hi to the people of planet GNOME!",
		"txt1": "Should I start with a deep introduction? Not sure! Okay, let me start from my first time with Linux. I installed my first Linux when I was around 17, It was OpenSUSE. I just burned iso and booted, HAHAHA It was a magnetic disk era. I think that time. After some years I was getting deep into Linux. After some years tried multiple distros. I consider Linux as an Icecream. Lots of flavors eat whatever you like. Or make own. 4-5 years ago I was jumping over multiple distros but now I'm settled on a custom build Debian distro. My first encounter with GNOME was on Fedora. I still love Fedora. But Debian is ultra-fast with only selected packages and easy to make its flavor. This is my short Linux story.",
		"txt2": "This year I'm selected into GSOC. Yay. well, the fun part is Its GNOME. I applied in only one Org. from the list, cause It was GNOME or nothing.",
		"txt3": "I was connected to one of my mentor month before GSOC start. He told me to fix some newcomers' issues on GitLab. That was my first contribution to GNOME.",
		"txt4": "After some time I committed almost 10-12 commits. I forgot to explain what I did, I was contributing to the Sound Recorder app. It was coded long ago with an old code base and the whole UI part was hardcoded. I cleaned lots of code and implemented all widgets to glade UI files. Which was essential to making future changes in application UI. I also cleaned all the code and updated old implementations. All of these done before I selected into GSOC.",
		"txt6": "I'm ending blog here, There's a lot more to explore on this planet.",
		"txt7": "I'm not sure whats I'm gonna write in the next blog. Is it development blog or general talking, God knows."
		"txt8": "Big thanks to my mentors Bilal Elmoussaoui and Felipe Borges. Always available when I needed to help me and guide me."
	}
}]
